Revit 2026 API

# PlasticVinylPlasticvinylColorByObject Property

---

The property labeled "Color By Object" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string PlasticvinylColorByObject { get; }
```
```vb
Public Shared ReadOnly Property PlasticvinylColorByObject As String
	Get
```
```cpp
public:
static property String^ PlasticvinylColorByObject {
	String^ get ();
}
```
```fsharp
static member PlasticvinylColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace